#pragma once
#include <dbghelp.h>
#include <d3dcompiler.h>
#include <wincodec.h>
#include <Shlobj.h>

#include "Globals.h"
#include "Matrix4x4.h"
#include "Log.h"

#define STACK_TIMER(Name) StackTimer Name(__FUNCTION__)
#define CS_LOCK(pCriticalSection) StackReadWriteLock _CRT_CONCATENATE(__FUNCTION__, Lock)(pCriticalSection)
#define CS_LOCK_SPINCOUNT(pCriticalSection, Spincount) StackReadWriteLock _CRT_CONCATENATE(__FUNCTION__, Lock)(pCriticalSection, (DWORD)(Spincount))

typedef struct StackTimer
{
	StackTimer(const char* szName)
		: m_szName(szName), m_start(clock()), m_end(0), m_duration(0.0)
	{

	}

	~StackTimer()
	{
		m_end = clock();
		m_duration = (double)(m_end - m_start) / CLOCKS_PER_SEC;

		printf("%s took %fs\n", m_szName, m_duration);
	}

private:
	clock_t m_start, m_end;
	double m_duration;
	const char* m_szName;
} DebugStackTimer;

struct StackReadWriteLock
{
	StackReadWriteLock(LPCRITICAL_SECTION pCriticalSection)
	{
		m_pCriticalSection = pCriticalSection;
		InitializeCriticalSection(m_pCriticalSection);
		m_bCriticalSectionInitialized = TRUE;
		EnterCriticalSection(m_pCriticalSection);
	}

	StackReadWriteLock(LPCRITICAL_SECTION pCriticalSection, DWORD dwSpinCount)
		: m_bCriticalSectionInitialized(FALSE)
	{
		m_pCriticalSection = pCriticalSection;
		/*
		* Windows Server 2003 and Windows XP:  If the function succeeds, the return value is nonzero.
		* If the function fails, the return value is zero (0). To get extended error information, call GetLastError.
		* Starting with Windows Vista, the InitializeCriticalSectionAndSpinCount function always succeeds, even in low memory situations.
		*/
		if (!InitializeCriticalSectionAndSpinCount(m_pCriticalSection, dwSpinCount))
			return;

		m_bCriticalSectionInitialized = TRUE;
		EnterCriticalSection(m_pCriticalSection);
	}

	~StackReadWriteLock()
	{
		if (m_bCriticalSectionInitialized)
		{
			LeaveCriticalSection(m_pCriticalSection);
			DeleteCriticalSection(m_pCriticalSection);
			m_bCriticalSectionInitialized = FALSE;
		}
	}

	// Delete Copy Constructor
	StackReadWriteLock(const StackReadWriteLock&) = delete;

	StackReadWriteLock& operator=(const StackReadWriteLock&) = delete;

private:
	LPCRITICAL_SECTION m_pCriticalSection;
	BOOL m_bCriticalSectionInitialized;
};

enum NierVersion
{
	NIERVER_UNKNOWN,
	NIERVER_100,
	NIERVER_101,
	NIERVER_102,
	NIERVER_102_UNPACKED,
	NIERVER_102_WOLF_EXTENDED_HEAPS,
	NIERVER_WINSTORE,
	NIERVER_DEBUG,
	NIERVER_MAX
};

static std::ostream& operator<<(std::ostream& os, const NierVersion& v)
{
	switch (v)
	{
	case NIERVER_100:
		os << "NieR:Automata (v1.00)";
		break;
	case NIERVER_101:
		os << "NieR:Automata (v1.01)";
		break;
	case NIERVER_102:
		os << "NieR:Automata (v1.02)";
		break;
	case NIERVER_102_UNPACKED:
		os << "NieR:Automata (v1.02 Unpacked)";
		break;
	case NIERVER_102_WOLF_EXTENDED_HEAPS:
		os << "NieR:Automata (v1.02 Extended Heaps)";
		break;
	case NIERVER_WINSTORE:
		os << "NieR:Automata (Winstore)";
		break;
	case NIERVER_DEBUG:
		os << "NieR:Automata (Debug)";
		break;
	case NIERVER_UNKNOWN:
	default:
		os << "NieR:Automata (Unknown Version)";
		break;
	}
	return os;
}

struct NierVersionInfo
{
	NierVersionInfo(NierVersion Version)
		: m_pHash(NULL), m_uHashSize(0), m_Version(Version)
	{
		Init();
	}

	NierVersionInfo(NierVersion Version, const char* Hash)
		: m_pHash((BYTE*)Hash), m_uHashSize(strlen(Hash)), m_Version(Version)
	{
		Init();
	}

	void Init(void)
	{
		switch (m_Version)
		{
		case NIERVER_100:
			m_szVersion = TEXT("NieR:Automata (v1.00)");
			break;
		case NIERVER_101:
			m_szVersion = TEXT("NieR:Automata (v1.01)");
			break;
		case NIERVER_102:
			m_szVersion = TEXT("NieR:Automata (v1.02)");
			break;
		case NIERVER_102_UNPACKED:
			m_szVersion = TEXT("NieR:Automata (v1.02 Unpacked)");
			break;
		case NIERVER_102_WOLF_EXTENDED_HEAPS:
			m_szVersion = TEXT("NieR:Automata (v1.02 Extended Heaps)");
			break;
		case NIERVER_WINSTORE:
			m_szVersion = TEXT("NieR:Automata (Winstore)");
			break;
		case NIERVER_DEBUG:
			m_szVersion = TEXT("NieR:Automata (Debug)");
			break;
		case NIERVER_UNKNOWN:
		default:
			m_szVersion = TEXT("NieR:Automata (Unknown Version)");
			break;
		}
	}

	bool operator==(NierVersionInfo& other) const
	{
		return !memcmp(this->m_pHash, other.m_pHash, m_uHashSize);
	}

	bool operator==(const BYTE* pHash) const
	{
		return !memcmp(this->m_pHash, pHash, m_uHashSize);
	}

	BYTE* m_pHash;
	ULONG_PTR m_uHashSize;
	NierVersion m_Version;
	TCHAR* m_szVersion;
};

static NTSTATUS QueryNierBinaryHash(NierVersionInfo& Version)
{
	//	TCHAR szFileName[MAX_PATH];

	// Set the inital status to success
	NTSTATUS Status = STATUS_SUCCESS;

	// Retrieve the size of the nier bin ary file path
	uint32_t uFileNameSize = MAX_PATH;//GetModuleFileName(NULL, NULL, 0);

	// Allocate the correct amount of memory
	TCHAR* szFileName = new TCHAR[(uFileNameSize + 1) * sizeof(TCHAR)];

	// Query the nier binary file path
	GetModuleFileName(NULL, szFileName, uFileNameSize + 1);

	// Query a file handle to the nier binary 
	HANDLE hFile = CreateFile(szFileName, GENERIC_READ, FILE_SHARE_READ, NULL, OPEN_EXISTING, FILE_ATTRIBUTE_NORMAL, NULL);

	// Free the nier binary file path
	delete[] szFileName;

	// If the handle is invalid, bail
	if (hFile == INVALID_HANDLE_VALUE)
		return STATUS_INVALID_HANDLE;

	// Query the file size of the nier binary
	DWORD dwFileSize = GetFileSize(hFile, NULL);
	DWORD dwBytesRead;

	// Allocate the memory for the nier binary
	BYTE* pBinary = new BYTE[dwFileSize];

	// Read the binary file
	ReadFile(hFile, pBinary, dwFileSize, &dwBytesRead, NULL);

	// Close the file handle to the nier binary
	CloseHandle(hFile);

	// Bail out if there was a partial read
	if (dwFileSize != dwBytesRead)
	{
		delete[] pBinary;
		return ERROR_CLUSTER_PARTIAL_READ;
	}

	ULONG uHashLengthSize;

	// Query the hash length
	Status = BCryptGetProperty(BCRYPT_SHA256_ALG_HANDLE, BCRYPT_HASH_LENGTH, (PUCHAR)&Version.m_uHashSize, sizeof(ULONG), &uHashLengthSize, 0);

	if (SUCCEEDED(Status))
	{
		// Allocate the memory for hash
		Version.m_pHash = new BYTE[Version.m_uHashSize];

		// Create the hash
		ULONG uBlockSize = (ULONG) Version.m_uHashSize;

		// Files bigger than 0xFFFFFFFF are unsupported and invoke UB
		Status = BCryptHash(BCRYPT_SHA256_ALG_HANDLE, NULL, 0, pBinary, dwFileSize, Version.m_pHash, (ULONG)Version.m_uHashSize);	
	}

	// Free the binary from memory
	delete[] pBinary;

	return Status;
}

static NTSTATUS QueryNierBinaryHash(BYTE*& pHash, ULONG& uHashSize)
{
	//	TCHAR szFileName[MAX_PATH];

	// Set the inital status to success
	NTSTATUS Status = STATUS_SUCCESS;

	// Retrive the size of the nier binary file path
	uint32_t uFileNameSize = MAX_PATH;//GetModuleFileName(NULL, NULL, 0);

	// Allocate the correct amount of memory
	TCHAR* szFileName = new TCHAR[(uFileNameSize + 1) * sizeof(TCHAR)];

	// Query the nier binary file path
	GetModuleFileName(NULL, szFileName, uFileNameSize + 1);

	// Query a file handle to the nier binary 
	HANDLE hFile = CreateFile(szFileName, GENERIC_READ, FILE_SHARE_READ, NULL, OPEN_EXISTING, FILE_ATTRIBUTE_NORMAL, NULL);

	// Free the nier binary file path
	delete[] szFileName;

	// If the handle is invalid, bail
	if (hFile == INVALID_HANDLE_VALUE)
		return STATUS_INVALID_HANDLE;

	// Query the file size of the nier binary
	DWORD dwFileSize = GetFileSize(hFile, NULL);
	DWORD dwBytesRead;

	// Allocate the memory for the nier binary
	BYTE* pBinary = new BYTE[dwFileSize];

	// Read the binary file
	ReadFile(hFile, pBinary, dwFileSize, &dwBytesRead, NULL);

	// Close the file handle to the nier binary
	CloseHandle(hFile);

	// Bail out if there was a partial read
	if (dwFileSize != dwBytesRead)
	{
		delete[] pBinary;
		return ERROR_CLUSTER_PARTIAL_READ;
	}

	ULONG uHashLengthSize;

	// Query the hash length
	Status = BCryptGetProperty(BCRYPT_SHA256_ALG_HANDLE, BCRYPT_HASH_LENGTH, (PUCHAR)&uHashSize, sizeof(ULONG), &uHashLengthSize, 0);

	if (SUCCEEDED(Status))
	{
		// Allocate the memory for hash
		pHash = new BYTE[uHashSize];

		// Create the hash
		Status = BCryptHash(BCRYPT_SHA256_ALG_HANDLE, NULL, 0, pBinary, dwFileSize, pHash, uHashSize);
	}

	// Free the binary from memory
	delete[] pBinary;

	return Status;
}

static NierVersionInfo* QueryNierBinaryVersion(void)
{
	static NierVersionInfo Versions[] =
	{
		{ NIERVER_101, "\xA0\x1A\xC5\x13\x2E\x10\x92\x52\xD6\xD9\xA4\xCB\xF9\x74\x61\x4D\xEC\xFB\xE3\x23\x71\x3C\x1F\xBF\x5B\xC2\x48\xF0\x12\x61\x77\x3F" },
		{ NIERVER_102, "\x51\x71\xBE\xD0\x9E\x6F\xEC\x7B\x21\xBF\x0E\xA4\x79\xDB\xD2\xE1\xB2\x28\x69\x5C\x67\xD1\xF0\xB4\x78\x54\x9A\x9B\xE2\xF5\x72\x6A" },
		{ NIERVER_102_UNPACKED, "\x5F\x97\x20\xD8\xC7\x7C\xD5\x97\x8E\xFE\x49\x88\x89\x3A\xF8\xFD\x99\x9F\x90\xA4\x76\xA8\xDE\xEB\xB3\x91\x26\x94\xF6\x18\xDC\x43" },
		{ NIERVER_102_WOLF_EXTENDED_HEAPS, "\xC9\x90\x4A\x39\xE4\x48\xD6\xCB\x3C\x98\xC2\x8A\x90\x15\x9C\xF9\x31\x47\x53\xB0\xCF\xEA\x5C\xEB\x4E\x76\xA1\x2D\x33\x08\xA3\x55" },
		{ NIERVER_WINSTORE, "\x3D\xDE\x56\x6C\xEA\x3E\x3B\xC1\x5E\x45\x92\x66\x02\xFB\x4F\x24\xD4\x8F\x77\xDF\x8A\x7B\xC5\x50\xA5\xB2\xDC\xAE\xCC\xCF\x09\x48" },
		{ NIERVER_DEBUG, "\xE9\xEF\x66\x01\xEB\x40\xEB\x0A\x6D\x3F\x30\xA6\x63\x95\x43\xEC\x2F\x81\x71\xC2\x6A\x3D\xE8\xB2\xB1\x30\x39\xEE\xBE\x3B\xC8\x1C" },
		{ NIERVER_UNKNOWN }
	};
	BYTE* pHash;
	ULONG uHashSize;

	// Set the version the first entry
	NierVersionInfo* pVersion = Versions;

	// Query the nier binary hash, if it fails return NIERVER_UNKNOWN
	if (FAILED(QueryNierBinaryHash(pHash, uHashSize)))
		return &Versions[ARRAYSIZE(Versions) - 1];

	// Traverse the array comparing the loaded binary hash to the known hashes
	for (; pVersion->m_Version != NIERVER_UNKNOWN; ++pVersion)
		if (*pVersion == pHash)
			break;

	// Free the hash memory
	delete[] pHash;

	return pVersion;
}

struct CCommon : public IUnknown
{
	//IUnknownVtbl* m_pVtbl;	//0x0000
	CCommon* m_pSelf;			//0x0008
	IID* pGuid;					//0x0010
};

// Size of struct 0x1A0 from _Common_NewRiid_
struct CDirectInputDevice8A : public IDirectInputDevice8A
{
	//IDirectInputDeviceAVtbl* m_pVtbl;	// 0x0000
	CDirectInputDevice8A* m_pDerived;	// 0x0008
	IID* pGuid;							// 0x0010
	char pad0018[0x12C];				// 0x0018
	volatile INT m_iReferenceCount;		// 0x0148
	DWORD m_dwThreadId;					// 0x014C
	CRITICAL_SECTION m_CriticalSection;	// 0x0150
	char pad0178[40];					// 0x0178
};
VALIDATE_OFFSET(CDirectInputDevice8A, m_pDerived, 0x0008);
VALIDATE_OFFSET(CDirectInputDevice8A, m_CriticalSection, 0x0150);
VALIDATE_SIZE(CDirectInputDevice8A, 0x01A0);

// TODO: finish dinput8.dll & gamerendereroverlay64.dll stuff
// Thanks valve and your gamerendereroverlay64.dll!HookedDirectInput8Create
#pragma region gamerendereroverlay64

// Size of struct 0x18 (24) bytes
struct CWrapDirectInput8
{
	void* m_pVtbl;						 //0x0000
	union {
		IDirectInput8A* m_pDirectInputA; //0x0008
		IDirectInput8W* m_pDirectInputW; //0x0008
	};
	bool m_bWideVersion;				 //0x0010
	
};
VALIDATE_SIZE(CWrapDirectInput8, 0x18);

// imaginary base class 
struct CWrapDirectInputDevice8
{
	void* m_pVtbl;							//0x0000
	union {
		IDirectInputDevice8A* m_pDeviceA;	//0x0008
		IDirectInputDevice8W* m_pDeviceW;	//0x0008
	};
};

// Size of struct 0x138 (312) bytes
struct CWrapKeyboardDevice8 //: public IWrapMouseDevice8
{
	void* m_pVtbl;							//0x0000
	union {
		IDirectInputDevice8A* m_pDeviceA;	//0x0008
		IDirectInputDevice8W* m_pDeviceW;	//0x0008
	};
	char pad0010[0x128];					//0x0010
};
VALIDATE_SIZE(CWrapKeyboardDevice8, 0x138);

// Size of struct 0x48 (72) bytes
struct CWrapMouseDevice8 //: public IWrapMouseDevice8
{
	void* m_pVtbl;							//0x0000
	union {
		IDirectInputDevice8A* m_pDeviceA;	//0x0008
		IDirectInputDevice8W* m_pDeviceW;	//0x0008
	};
	char pad0010[56];						//0x0010
};
VALIDATE_SIZE(CWrapMouseDevice8, 0x48);

#pragma endregion gamerendereroverlay64

static void IDirectInputDevice_Lock(IDirectInputDevice8A* pDevice)
{
	// For fucks that have a dinput8.dll hook we need to specify we want the original dll!
	static HMODULE s_hDirectInput8 = GetModuleHandle(TEXT("System32\\dinput8.dll"));
	HMODULE hOwnerModule = NULL;

	if (s_hDirectInput8 != RtlPcToFileHeader(*(void**)pDevice, (PVOID*)&hOwnerModule))
	{
		//pDevice = CONTAINING_RECORD(pDevice, CWrapDirectInputDevice8, m_pDeviceA);
		pDevice = ((CWrapDirectInputDevice8*)pDevice)->m_pDeviceA;
	}

	CDirectInputDevice8A* pImpl = CONTAINING_RECORD(pDevice, CDirectInputDevice8A, m_pDerived);

	EnterCriticalSection(&pImpl->m_CriticalSection);
}

static void IDirectInputDevice_Unlock(IDirectInputDevice8A* pDevice)
{
	// For fucks that have a dinput8.dll hook we need to specify we want the original dll!
